"""SEP
Разделение аргументов print
Если sep='' (пусто), то Python убирает пробелы между символами."""
print ('aaa','bbb','ccc', sep='->')


"""END
Вставка последнего символа в строку.
Если end='' (пусто), то переноса строки не происходит."""

print ('aa', 'bbb', 'ccc', end='')
print ('ddd', 'eee', 'fff', end='')


"""format
a = float (input ())
b = float (input ())
print (a, '/', b, '=', '{:10.7f}'.format (a / b))

Вывод:
a = float (input ())
b = float (input ())
0.001 / 5000.0 =  0.0000002"""

# \t	вставка табуляции (при этом не происходит перехода на след. строку!)
# \n	перенос на строку (перевод каретки)


